#include <stdio.h>
#include <string.h>

void reverse (char str1[], char str2[]);

int main () {
    char text [ 50 ]; 

    // char text [ 50 ] = "I Love You" ;

    char out [ 50 ] ;
    gets(text);

    reverse (text,out);

    printf("%s",out);
}

void reverse (char str1[], char str2[]){
    //หาความยาวของ อาเร หรือข้อความ
    int len = 0;
    while (str1[len] != '\0') { //ทำการ loop โดยเริ่มตั้งเเต่ตัวที่ 0 ของ str คือ len เเละ 
        len++;                        //ทำการ loop ไปเรื่อยๆจนกว่าจะเจอ \0 เพราะเป็นตัวสุดท้ายที่ใช้ปิดท้ายใน array
    } //เเละให้ บวกหนึ่งเขาไปทีละรอบในตัวเเปล len

    int j = 0; //กำหนด ตัวนับการกลับด้าน
    
    for (int i = len -1; i >= 0 ; i--) { //ใช้ for โดยให้ i คือ ความยาวของ len - 1 จะเท่ากับ 9 เเละให้ i วนจนครบหรือเท่ากับ 0 โดยลดค่าลงไปทีล่ะหนึ่ง
        str2[j] = str1[i]; //ให้ str1[i] คือค่าตั้งเเต่ str[9] ลงมานำค่าไปใส่ใน str2[j] ที่เริ่มต้นตั้งเเต่ 0  
        j++; //เเละทำการบวก j ไปทีล่ะหนึ่งเพิ่มทำการขยับตำเเหน่งตัวอักษร
    }

    str2[j] = '\0'; // ให้ str[j] ปิดท้ายด้วย \0 สำคัญคือ ต้องปิดท้ายด้วย \0 เสมอ
}